### Pandas con ficheros

In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [2]:
df = pd.read_csv("../ficheros_curso/merge/Pedidos.txt", sep=';')
df.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [6]:
df.tail()

     idpedido cliente  idempleado  idempresa  importe            pais
825     11073   PERIC           2          2    24.95          Mexico
826     11074   SIMOB           7          2    18.44       Dinamarca
827     11075   RICSU           8          2     6.19           Suiza
828     11076   BONAP           4          2    38.28         Francia
829     11077   RATTC           1          2     8.53  Estados Unidos

In [4]:
df.shape

(830, 6)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   idpedido    830 non-null    int64
 1   cliente     830 non-null    object
 2   idempleado  830 non-null    int64
 3   idempresa   830 non-null    int64
 4   importe     830 non-null    float64
 5   pais        830 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 39.0+ KB

In [7]:
df.describe()

           idpedido  idempleado   idempresa      importe
count    830.000000  830.000000  830.000000   830.000000
mean   10662.500000    4.403614    2.008434    78.244205
std      239.744656    2.499648    0.778899   116.779294
min    10248.000000    1.000000    1.000000     0.020000
25%    10455.250000    2.000000    1.000000    13.380000
50%    10662.500000    4.000000    2.000000    41.360000
75%    10869.750000    7.000000    3.000000    91.430000
max    11077.000000    9.000000    3.000000  1007.640000

In [9]:
s = df.pais.value_counts()
s

pais
Estados Unidos    123
Alemania          122
Brasil             83
Francia            76
Reino Unido        55
Venezuela          46
Austria            40
Suecia             38
Canada             30
Mexico             28
Italia             28
Espanya            23
Finlandia          23
Irlanda            19
Belgica            19
Suiza              18
Dinamarca          18
Argentina          16
Portugal           13
Polonia             6
Noruega             6
Name: count, dtype: int64

In [11]:
(s > 100).sum()

2

In [13]:
paises = sorted(df.pais.unique())
paises

['Alemania',
 'Argentina',
 'Austria',
 'Belgica',
 'Brasil',
 'Canada',
 'Dinamarca',
 'Espanya',
 'Estados Unidos',
 'Finlandia',
 'Francia',
 'Irlanda',
 'Italia',
 'Mexico',
 'Noruega',
 'Polonia',
 'Portugal',
 'Reino Unido',
 'Suecia',
 'Suiza',
 'Venezuela']

In [19]:
len(paises)

21

In [16]:
dfPortugal = df[(df.pais=='Portugal') & (df.importe > 60)]
dfPortugal

     idpedido cliente  idempleado  idempresa  importe      pais
80      10328   FURIB           4          3    87.03  Portugal
149     10397   PRINI           5          1    60.26  Portugal
185     10433   PRINI           3          3    73.83  Portugal
216     10464   FURIB           4          2    89.00  Portugal
303     10551   FURIB           4          3    72.95  Portugal
759     11007   PRINI           8          2   202.24  Portugal

In [18]:
dfPortugal.to_csv("../ficheros/portugal.csv", sep=';', index=False, decimal=',')

#### Generar un fichero Excel por cada país con sus pedidos

In [22]:
paises = sorted(df.pais.unique())
for pais in paises:
    paisFile= df[df.pais==pais]
    print(pais)
    paisFile.to_excel(f"../ficheros/pedidos/{pais}.xlsx", sheet_name="pedidos", index=False)

Alemania
Argentina
Austria
Belgica
Brasil
Canada
Dinamarca
Espanya
Estados Unidos
Finlandia
Francia
Irlanda
Italia
Mexico
Noruega
Polonia
Portugal
Reino Unido
Suecia
Suiza
Venezuela

#### Crear columnas calculadas

In [23]:
df.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [26]:
df["porc_iva"] = 0.21
df["iva"] = round(df.porc_iva * df.importe, 2)
df["total"] = df.iva + df.importe
df.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,porc_iva,iva,total
0,10248,WILMK,5,3,32.38,Finlandia,0.21,6.80,39.18
1,10249,TOMSP,6,1,11.61,Alemania,0.21,2.44,14.05
2,10250,HANAR,4,2,65.83,Brasil,0.21,13.82,79.65
3,10251,VICTE,3,1,41.34,Francia,0.21,8.68,50.02
4,10252,SUPRD,4,2,51.30,Belgica,0.21,10.77,62.07

In [35]:
df['total'] = np.round(df.total, 2)
df2=df[['idpedido','cliente','importe','porc_iva','iva','total','pais']]
df2.head()

   idpedido cliente  importe  porc_iva    iva  total       pais
0     10248   WILMK    32.38      0.21   6.80  39.18  Finlandia
1     10249   TOMSP    11.61      0.21   2.44  14.05   Alemania
2     10250   HANAR    65.83      0.21  13.82  79.65     Brasil
3     10251   VICTE    41.34      0.21   8.68  50.02    Francia
4     10252   SUPRD    51.30      0.21  10.77  62.07    Belgica

In [36]:
df2.to_html("../ficheros/pedidos.html", index=False)

In [37]:
df2.to_xml("../ficheros/pedidos.xml",index=False, root_name='pedidos', row_name='pedido')

In [39]:
df2.to_json("../ficheros/pedidos.json", indent=4, orient='records')

#### GroupBy en pandas

In [40]:
grupo = df.importe.groupby(df.pais)
type(grupo)

pandas.core.groupby.generic.SeriesGroupBy

In [41]:
grupo.sum()

pais
Alemania          11283.28
Argentina           598.58
Austria            7391.50
Belgica            1280.14
Brasil             4880.19
Canada             2198.09
Dinamarca          1396.19
Espanya             861.89
Estados Unidos    13783.33
Finlandia           943.27
Francia            4205.46
Irlanda            2755.24
Italia              864.44
Mexico             1122.78
Noruega             275.50
Polonia             163.70
Portugal            643.53
Reino Unido        2943.31
Suecia             3248.56
Suiza              1368.53
Venezuela          2735.18
Name: importe, dtype: float64

In [42]:
grupo.min()

pais
Alemania           0.15
Argentina          0.33
Austria            5.29
Belgica            0.17
Brasil             0.14
Canada             0.94
Dinamarca          2.92
Espanya            1.25
Estados Unidos     0.20
Finlandia          0.59
Francia            0.02
Irlanda           16.74
Italia             0.48
Mexico             0.40
Noruega            4.62
Polonia            3.94
Portugal           1.27
Reino Unido        0.90
Suecia             1.23
Suiza              1.17
Venezuela          0.12
Name: importe, dtype: float64

In [45]:
grupo2 = df.importe.groupby([df.pais,df.cliente])
grupo2.sum()

pais       cliente
Alemania   ALFKI       225.58
           BLAUS       168.26
           DRACD       306.04
           FRANK      1403.44
           KOENE       813.68
                       ...
Suiza      RICSU      1001.29
Venezuela  GROSR        67.80
           HILAA      1259.16
           LILAS       734.41
           LINOD       673.81
Name: importe, Length: 89, dtype: float64